tutorials/18DEIM_NS/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "./ITHACAoutput/Offline/1";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
400
(
(0.0830399 -0.0822435 0)
(-0.0154348 -0.00200945 0)
(-0.558932 0.0899373 0)
(-1.46424 0.152442 0)
(-2.58942 0.184111 0)
(-3.78948 0.189621 0)
(-4.93508 0.174269 0)
(-5.91712 0.142382 0)
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           uniform (402.667 0 0);
    }
    fixedWalls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

