tutorials/18DEIM_NS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0;
        smoother        GaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0;
    }
    Phi
    {
        $p;
    }
}

relaxationFactors
{
    fields
    {
        p               0.1;
        Paux            0.1;
    }
    equations
    {
        U               0.5;
        nuTilda         0.7;
        Uaux            0.5;
    }
}

cache
{
    grad(U);
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    PhiRefCell 0;
    PhiRefPoint 0;
    PauxRefCell 0;
    PauxRefPoint 0;
    PauxRefValue 0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
    PhiRefCell 0;
    PhiRefValue       0;
    PhiRefPoint 0;
}



// ************************************************************************* //
